config/.config/doom/config.org
#+title:  doom emacs config
#+author: emil lenz
#+email:  emillenz@protonmail.com
#+date:   2022-11-01
#+info:   heavily opinionated config, with a principle-focused approach on: consistency, quality, efficiency & extensibility.

#+property: header-args:elisp tangle config.el :comments link :results silent
#+macro: src-len (eval (save-excursion (find-file doom-module-config-file) (count-lines (point-min) (point-max))))

* about this config
- a total of {{{src-len}}} LOC.
- for debugging our configuration, start emacs with: ~emacs --debug-init~ to get a backtrace.  when debuggin lisp code, enable ~toggle-debug-on-error~ and eval the code.
- read up on and adhere to [[https://github.com/bbatsov/emacs-lisp-style-guide][emacs-lisp style guide]].
- user defined global functions and variables are prefixed with ~u-~ (~user~) to distinguish them from emacs/library ones.
- lazyload packages using ~after!~.  this keeps emacs efficent, since it now only loads the settings & packages when they are actually needed (no emacs bankruptcy).
- i believe that customizations are personal and should not be blindly copied.  Everyone should carefully consider each customizable setting they hear about and decide for themselves whether they like it or not.  Non-trivial customizations that include Lisp code should be fully understood before they are accepted, rejected, or amended to personal taste.  (read the manual)
  - be encouraged to master the tool that we are using.  this means thoroughly reading the complete documentation, keymaps for the tools we are using (eg. vertico, evil-mode, magit, leader-mode).
  - try to first fundamentally understand & master the functionality the tool offers.  then we may assess and see if a extension really provides value to us, or if that functionality is already included.
- use ~use-package!~ for configuring packages added via ~package!~ in ~./packages.el~
- to debug, start emacs with ~emacs --debug-init~ and use ~emacs --no-init-file~ to fix the errors.
- to see how you may configure a package, ~customize-group~ gives a good overview of available options (but never use it to set an option.  do that in ~config.org/el~)
- viper mode :: use it if it's not feasible to install the full doom-config (eg. using emacs on another computer).
  - we shall never use ~:ex~ commands and instead use the native ~M-x~ and ~C-x / C-c~ bindings that emacs provides for a more consistent experience.
    - viper provides 80% of evil-mode's ergonomics with emacs extensibility and power.
- if you remove a package, search this entire config for entries to also remove, since some configuration entries are centralized under different headings (eg. ~indentation~).
- we always make use of threading operators: ~->>~, since this greatly enhances readability.


* preface
** why emacs
#+begin_quote
Today, many aspects of daily computer usage are split between different applications which act like islands, but this often doesn’t mirror how we actually use our computers.  Emacs, if one goes down the rabbit hole, can give users the power to bridge this gap into a visually and functionally consistent environment.

Professional, minimalist tools like Emacs have a high learning curve and require thought and time to initially set up.  But once things are working and customized they will work for years at a stretch without needing to fiddle with the nobs.  And once mastered you can eliminate the "modern" GUI bits -- tool bars, menus, scrollbars and fancy animations and the like and what is left is about as clean an interface as you can get stripping everything down to the bare metal where it gets out of your way and provides the most streamlined workflow.  The difference is that something like emacs is a longterm investment, it requires you to get over the high entry barrier but then never annoys you with a more elongated, bloated workflow that in other, more beginner friendly applications is the norm and cannot be changed away from.

The saying, "give 'em enough rope, and they'll likely hang themselves," holds true.  Emacs provides the rope if you are not careful.
--- anonymous
#+end_quote

emacs is one of the most incredible piece of software ever made:
- purely keyboard driven.
- everything is text and can be modified.
- enables one to complete tasks with a consistent, standard set of keybindings, gui and editing methods - learn once, use everywhere
- compressing the stages of a project - a more centralised workflow can progress with greater ease
- integration between tasks previously relegated to different applications, but with a common subject - e.g.  linking to an email in a to-do list etc
- emacs can be thought of as a platform within which various elements of our workflow may settle, while being able to interlink them interactively.
- reduced context-switching, many tools in one connected, coherent, interwoven keyboard-driven interface.  this integration is very efficient and consistent, since now any function can be reused in all tools (eg.  fuzzy finding, and doesn't have to be implemented in each separate program itself).  it greatly reduces the mental overhead needed to customize and extend the tools, since the context and language is always the same.  since these tools are text-centric, they align withthe single focus, no multitasking buffer wokflow philosophy.
  - editor
    - technical documents :: latex & org
    - academic papers
    - code
    - notes
    - journaling
  - coding tools
    - git interface :: magit
    - manpages
    - diff
    - debugger
  - agenda
  - emailclient
  - todo-management :: org mode
  - filemanager :: dired fast interactive text-based file manger
  - manpager
  - file/dir navigation & management: find-file, fuzzy-find, (book)marks, dired
    - the most efficient workflow for finding, opening and editing files on the os that i have ever developed.

*** org mode
- the most elegant markup language, all the while keeping the syntax opinionated and simple with only one way to do it (=> looking at you: markdown with your weird spacing rules and arcane markup for links/quotes).
- one to rule them all, create websites, tables, journals, todolists, calendars and programs, all with the same consistent elegant and formatted syntax.
- automate making entries into files and databases at specific places.
- completely integrated into the editor (think: finding/filtering headlines, notes, tasks..)
- the best support for literate programming covering every language (looking at you: jupyter..)

*** emacs everywhere
use emacs everywhere for anytime we are using a prompt that requires more than few simple keywords.  eg. chatgpt query, writing a email.  execute emacs-everywhere from i3 (via keybinding) once inside the textfield (or highlighting all text to take over to emacs)

*** downsides
emacs sucks at graphical stuff, hence we use external programs to display pdfs and media.

** emacs as the computing evironment
- extend emacs by writing custom functions for things that are done repetitivly (moving files, manipulating text...) instead of writing shell aliases / shellscripts
  + more extensible and in a proper language
  + write shell-scripts (purely) for launching programs & processes.
- all coding, writing, fileopening, viewing, navigating is done inside emacs (do not leave the environment), because this makes for a consistent and coherent workflow.  don't jump in and out of the commandline, lauching emacs instances, cd'ing around.
  - use inbuilt programs like magit & diff for more speed interactivity and ergonomics than doing it with git command aliases on the command-line.

** shell: using emacs instead of dedicated terminal
we might be tempted to use a terminal with tmux, zsh/fish, fzf, fancy prompts, bat, exa, and pages filled with git aliases configured.  this results in great complexities and inconsistencies (trying to get the same keybindings, theme etc.) in the shell and editor.  instead shun all these features and focus on emacs.  using emacs yields consistency in bindings between the shell and the editor.  no more juggling tmux and the system clipboard when trying to yank/paste text.  no installing tons of shell-plugins to get better vim emulation in the shell (looking at you *zsh*).  we can seamlessly open and switch between man/help/tldr pages while using the shell.  we can navigate & filter (~occur~, etc...) the shell output (instead of using some hacked up, incomplete and inconsistent vim emulation like tmux).  instead of using cd etc. we can freely use all of emacs navigational capabilities (projectile, recentfiles...) (instead of having to install fzf and other crutches).
our syntax highlighting (including help output etc) is directly inherited from our emacs-theme.
using emacs for shells also has the benefit that we can seamlessly create a buffer to script in as soon as we're doing more than a simple oneliner, then either evaluating that buffer or regions to the shell.

*** workflow
use simple minbuffer based ~async-shell-command~'s in emacs, if that doesn't suffice, open: ~shell~.  especially when programming, start REPL's and interactive environments from within emacs (terminal emulation) in order to have a seamless integration and navigation between running commands in the shell and programmning.  this has the benefit that of being able to navigate command output like a normal buffer and use the full power of emacs for the prompt editing.

the only reason for us to ever use a terminal is if we need to use a TUI or a completely detached background process (eg. a server).

* user
#+begin_src elisp
(setq user-full-name "emil lenz"
      user-mail-address "emillenz@protonmail.com")
#+end_src

* global options
#+begin_src elisp
(let ((width 100))
  (setq fill-column width
        async-shell-command-width width
        visual-fill-column-width width))

(global-visual-fill-column-mode)
(global-visual-line-mode)
#+end_src

#+begin_src elisp
(setq initial-scratch-message ""
      delete-by-moving-to-trash t
      bookmark-default-file "~/.config/doom/bookmarks" ;; save bookmarks in config dir (to preserve inbetween newinstalls)
      auto-save-default t
      confirm-kill-emacs nil
      enable-recursive-minibuffers t ;; all of emacs available even if in minibuffer.
      shell-command-prompt-show-cwd t)

(save-place-mode)

(global-subword-mode)

(add-hook! prog-mode-hook #'rainbow-delimiters-mode)

(setq global-auto-revert-non-file-buffers t)
(global-auto-revert-mode)
#+end_src

- HACK :: must disable, since it displays the ~flycheck~ inline warnings/errors incorrectly.
#+begin_src elisp
(add-hook! 'prog-mode-hook
  (visual-fill-column-mode -1))
#+end_src

- HACK :: we don't use macos, and ~+default/man-or-woman~ doesn't invoke ~man~ correctly
#+begin_src elisp
(advice-add '+default/man-or-woman :override #'man)
#+end_src

* ui
** modus-theme
#+begin_src elisp
(use-package! modus-themes
  :config
  (setq modus-themes-italic-constructs t
        modus-themes-bold-constructs t
        modus-themes-common-palette-overrides `((fg-region unspecified) ;; don't grey out syntax highlighting in active region
                                                (fg-heading-1 fg-heading-0))) ;; colorize (before: black)
  ;; list of customizeable faces: `(helpful-variable 'modus-themes-faces)`
  (custom-set-faces!
    '(org-list-dt :inherit modus-themes-heading-1)
    `(org-block-begin-line :foreground ,(modus-themes-get-color-value 'prose-metadata))
    '(org-quote :slant italic)

    '(comint-highlight-prompt :weight bold))

  (setq doom-theme 'modus-operandi))
#+end_src

the ~org-block~ background is different (dimmed) from ~bg-main~ in order to distinguish blocks clearly.  ~whitespace-tab~ uses ~bg-main~ by default, but we want same dimmed bg color as all text.
#+begin_src elisp
(add-hook! 'org-mode-hook
  (face-remap-add-relative 'whitespace-tab 'org-block))
#+end_src

** font
- same font & size set to same as system-wide (browser, gtk, terminal, ...).
- variable-pitch-mode :: only for prose i sometimes use a serif font to become more immersed in the reading experience.  like the modeline & minibuffer, we use the default font for line-numbers (by default not the case).
- font-size :: don't use manual font-size increasing, instead just use ~doom-big-font-mode~ (eg. for presentation purposes)
- ~simple-html-rendering~ (~shr~) ::  should always use the universally applicable default font since we can't presume the content to be displayed with it.  (it is used for eg. ~devdocs~)
#+begin_src elisp
(setq doom-font (font-spec :family "Iosevka Comfy" :size 13))
(setq doom-variable-pitch-font (font-spec :family "Noto Serif" :size 13))

(set-face-attribute 'line-number nil :inherit 'fixed)

(after! shr
  (setq shr-use-fonts nil))
#+end_src

** modeline
- no overlapping funcionality (time & date is on my physical wrist watch, don't need it in any program (also not wm)).
- very minimal, only displaying what's needed (using (:modeline +light))
#+begin_src elisp
(setq display-battery-mode nil
      display-time-mode nil
      +modeline-height 8
      +modeline-bar-width nil) ;; hide unicode sugar
#+end_src

