config/.config/doom/config.org
** display buffers
- single maximized buffer workflow :: we explicitly never use more than a single window (we don't split a window) in the frame, since we can only ever focus on a single thing anyways, and thus in the meantime other windows would clutter the screen distractingly.  additionally using multiple windows introduces additional navigational overhead first having to go to the correct window before using ~switch-to-buffer~, ~harpoon~ etc. managing windows and placing them correctly is complex and inconsistent, some windows recieve focus, other's don't, some buffer's create a split, completely changing window layout, others don't.  instead of using windows, we must become really efficient at navigating between buffers using ~switch-to-buffer~, ~evil-switch-to-windows-last-buffer~, ~harpoon~ and evil's ~global-marks~.  it is more efficiet to just change the buffer in the current window, instead of getting disrupted by the newly opened window.
- only horizontal split :: since emacs sometimes creates splits in special views (eg. magit, ediff) or for displaying additional information (lsp-help...), and thus we must handle them to consistently split below and never side-by-side, since due to the wm, our emacs window is in full height but has a constrained width, perfectly sized for displaying source-code / technical documents.
- minibuffers :: at the bottom, consistent with ~minibuffer-prompt~, ~whichkey~, etc.  use ~doom/window-enlargen~ as needed.

#+begin_src elisp
(setq display-buffer-alist `((,(rx (seq "*" (or "transient"
						(seq "Org " (or "Select" "todo"))
						"Agenda Commands"
						"doom eval"
						"Backtrace"
						"lsp-help"
						"Async Shell Command")))
			      display-buffer-in-side-window
			      (window-parameters . ((mode-line-format . none)))
			      (window-height . fit-window-to-buffer)
			      (side . bottom))

			     ("."
			      display-buffer-same-window))

      switch-to-buffer-obey-display-actions t)
#+end_src

some modes implement their own buffer popup system or make use of ~switch-to-buffer-other-window~ we make them obey/consitent with ~display-buffer-alist~'s behaviour.
#+begin_src elisp
(after! org
  (setq org-src-window-setup 'plain ;; use display-buffer setting
        org-agenda-window-setup 'current-window))

(after! man
  (setq Man-notify-method 'pushy))

(advice-add #'switch-to-buffer-other-window :override #'switch-to-buffer)

(after! cider
  (setq cider-auto-select-error-buffer nil
	cider-inspector-auto-select-buffer nil
	cider-jump-to-pop-to-buffer-actions '((display-buffer-in-side-window))))

(after! magit
  (setq magit-commit-diff-inhibit-same-window t
        +magit-open-windows-in-direction 'down))
#+end_src

** line numbers
- we make extensive use of relative line motions (eg: ~12dj~ etc.).
#+begin_src elisp
(setq display-line-numbers-type 'relative)
#+end_src

** formatting
don't format my file automatically on-save.  instead format by calling it manually.  sometimes a file needs manual alignment that a formatter destroys.  our old ass computer is to weak to be able to run a format each time the file is saved.

** indentation
*** rationale
a useful time for a quote from the linux kernel coding standards [1] - exactly the first item in fact:

#+begin_quote
Tabs are 8 characters, and thus indentations are also 8 characters.  There are heretic movements that try to make indentations 4 (or even 2!) characters deep, and that is akin to trying to define the value of PI to be 3.  If you need more than 4 levels of indentation within a function, you’re screwed anyway, and should fix your program.
--- Linus Torvalds
#+end_quote

the 8-wide tab indent cannot exist in isolation.  it has to be coupled with a right-hand side limit of 80 columns.  otherwise, you could just indent yourself off to infinity and there would be no consequences.  an 80 column limit forces you to keep your code within reasonable limits.

the whole idea behind indentation is to clearly define where a block of control starts and ends.  this is the same philosophy applied in ~modus-theme~, where we clearly want to separate elements and enhace legibility & accessibility.  especially when you’ve been looking at your screen for 20 straight hours, you’ll find it a lot easier to see how the indentation works if you have large indentations.  you can look at a function definition from afar and tell easily where it begins & ends even though you cannot read the actual code.  it facilitates reading through a codebase in a more tree-like fashion.

every level of indentation represents a piece of program state the reader has to keep in their head to understand a function.  “in this line, i know line points to the nth line as long as x is not true, but y > z.” 8-character indentations, internal spacing, and the 80-column rule effectively limits you to 4 levels of indentation in a function.  this effectively limits the internal complexity of any give function, which makes the code easier to understand and debug!  so the underlying functionality remains minimal and concise.

in short, 8-wide indents make things easier to read, and have the added benefit of warning you when you’re nesting your functions too deep.  heed that warning.

- consistency :: the only reliable, repeatable, transportable way to ensure that indentation remains consistent across programming languages is to indent code using only tabs.
- tabs have the semantic meaning of indentation.  tabs always align to the same column, no matter from where inserted in the column.
- tabs allow impaired users to display indentation in the way they deem most ergonomic (accessibility!).
- TODO :: always configure your language formatters (eg. clang-format) to use tabs for indentation.
#+begin_src elisp
(defvar u/global-indent-width 8)

(setq-default indent-tabs-mode t
              tab-width u/global-indent-width
              standard-indent u/global-indent-width
              evil-indent-convert-tabs t
              evil-shift-width u/global-indent-width
              org-indent-indentation-per-level u/global-indent-width)

(setq c-default-style "linux")

(after! sh-script
  sh-basic-offset u/global-indent-width)
#+end_src

* evil-mode
- evil comes with powerful additions and bindings that are to be discovered: [[~/.config/emacs/modules/editor/evil/README.org::* TODO Usage][evil readme]].  familiarize and harness their power.
- evil-magic 'nomagic :: statistically its more sensible to incsearch without regex (if we need it, use ~\m~ as a prefix in search string to enable regex.

~after! evil~ begin
#+begin_src elisp
(after! evil
#+end_src

#+begin_src elisp
(evil-surround-mode)
(setq evil-want-fine-undo nil
      evil-magic 'very-nomagic
      evil-ex-substitute-global t
      evil-want-C-i-jump t
      evil-want-C-h-delete t
      evil-want-minibuffer t ;; don't loose our powers in the minibuffer
      evil-org-use-additional-insert nil)

(defadvice! u/preserve-point (fn &rest args)
  :around '(anzu-query-replace-regexp
            query-replace-regexp
            +format:region)
  (save-excursion
    (apply fn args)))

;; FIXME :: `+fold/previous` disabled, since it crashes emacs. (don't call it by accident via binding)
(advice-add '+fold/previous :override #'ignore)

;; HACK :: sometimes cursor stays int normal-mode (even though we are in insert mode).  this fixes the inconsistency.
(setq-hook! 'minibuffer-setup-hook cursor-type 'bar)
#+end_src

- jumplist is for functions that jump out of screen
- don't populate jumplist with fuctions that are executed repeatedly (ex: forward-paragraph)
#+begin_src elisp
(dolist (cmd '(flycheck-next-error
		 flycheck-previous-error
		 +lookup/definition
		 +lookup/references
		 +lookup/implementations
		 +default/search-buffer
		 consult-imenu))
  (evil-add-command-properties cmd :jump t))

(dolist (cmd '(evil-backward-section-begin
		 evil-forward-section-begin
		 evil-jump-item
		 evil-backward-paragraph
		 evil-forward-paragraph
		 evil-forward-section-end))
  (evil-remove-command-properties cmd :jump))
#+end_src

#+begin_src elisp
(defadvice! u/update-last-macro-register (fn &rest args)
  "when a macro was recorded and `evil-last-register' is still `nil' (no macro was executed yet),
  set it to the just recorded macro.

this is the sane default behaviour for 99% of the time: record a quick macro with 'qq' and
immediately call it with '@@', instead of getting an error, getting annoyed and having to retype
'@q' (the exact key) for the first time and then only after that we may call '@@'."
  :after #'evil-record-macro
  (when (not evil-last-register)
    (setq evil-last-register evil-last-recorded-register)))
#+end_src

- make evil's global markers persist across sessions (save state => reduce repetition, increase consistency).  this is default behaviour in vim.
#+begin_src elisp
(after! savehist
  (add-to-list 'savehist-additional-variables 'evil-markers-alist)

  (add-hook! 'savehist-save-hook
    (kill-local-variable 'evil-markers-alist)
    (dolist (entry evil-markers-alist)
      (when (->> (cdr entry)
		 markerp)
	(setcdr entry
		(cons (->> entry
			   cdr
			   marker-buffer
			   buffer-file-name
			   file-truename)
		      (->> entry
			   cdr
			   marker-position))))))

  (add-hook! 'savehist-mode-hook
    (setq-default evil-markers-alist evil-markers-alist)
    (kill-local-variable 'evil-markers-alist)
    (make-local-variable 'evil-markers-alist)))
#+end_src

~after! evil~ end
#+begin_src elisp
)
#+end_src

* global keybindings
- ~helpful-key~ and are crucial to understanding what our tools can do for us (ex: magit, dired, org-mode)
- i recommend to lookup the variable: ~M-x helpful-variable <X-mode-map>~ to get an overview of the available bindings for that mode.  find out the mode with: ~M-x describe-mode~
- always keep on exploring, learning new, efficient keybindings and break old routines for newer, more effcient one's after evaluating wether they are faster or not.
- localleader :: [[kbd:][:leader m]] mnemonic for ~major-mode~.  additionally it can be pressed in rapid succession ergonomically (at least on ~dvorak & querty~).
- generally [[kbd:][ctrl]] bindings in vim are either for insert mode or navigation (eg. [[kbd:][C-u/d/j/k/o]]).
- make sure to use toplever leader mappings: [[kbd:][SPC ,]] ~consult-buffer~, [[kbd:][SPC SPC]] ~projectile-find-file~. since they are some of the most called functions.

