config/.config/doom/config.el

;; [[file:config.org::*display buffers][display buffers:1]]
(setq display-buffer-alist `((,(rx (seq "*" (or "transient"
						(seq "Org " (or "Select" "todo"))
						"Agenda Commands"
						"doom eval"
						"Backtrace"
						"lsp-help"
						"Async Shell Command")))
			      display-buffer-in-side-window
			      (window-parameters . ((mode-line-format . none)))
			      (window-height . fit-window-to-buffer)
			      (side . bottom))

			     ("."
			      display-buffer-same-window))

      switch-to-buffer-obey-display-actions t)
;; display buffers:1 ends here

;; [[file:config.org::*display buffers][display buffers:2]]
(after! org
  (setq org-src-window-setup 'plain ;; use display-buffer setting
        org-agenda-window-setup 'current-window))

(after! man
  (setq Man-notify-method 'pushy))

(advice-add #'switch-to-buffer-other-window :override #'switch-to-buffer)

(after! cider
  (setq cider-auto-select-error-buffer nil
	cider-inspector-auto-select-buffer nil
	cider-jump-to-pop-to-buffer-actions '((display-buffer-in-side-window))))

(after! magit
  (setq magit-commit-diff-inhibit-same-window t
        +magit-open-windows-in-direction 'down))
;; display buffers:2 ends here

;; [[file:config.org::*line numbers][line numbers:1]]
(setq display-line-numbers-type 'relative)
;; line numbers:1 ends here

;; [[file:config.org::*rationale][rationale:1]]
(defvar u/global-indent-width 8)

(setq-default indent-tabs-mode t
              tab-width u/global-indent-width
              standard-indent u/global-indent-width
              evil-indent-convert-tabs t
              evil-shift-width u/global-indent-width
              org-indent-indentation-per-level u/global-indent-width)

(setq c-default-style "linux")

(after! sh-script
  sh-basic-offset u/global-indent-width)
;; rationale:1 ends here

;; [[file:config.org::*evil-mode][evil-mode:1]]
(after! evil
;; evil-mode:1 ends here

;; [[file:config.org::*evil-mode][evil-mode:2]]
(evil-surround-mode)
(setq evil-want-fine-undo nil
      evil-magic 'very-nomagic
      evil-ex-substitute-global t
      evil-want-C-i-jump t
      evil-want-C-h-delete t
      evil-want-minibuffer t ;; don't loose our powers in the minibuffer
      evil-org-use-additional-insert nil)

(defadvice! u/preserve-point (fn &rest args)
  :around '(anzu-query-replace-regexp
            query-replace-regexp
            +format:region)
  (save-excursion
    (apply fn args)))

;; FIXME :: `+fold/previous` disabled, since it crashes emacs. (don't call it by accident via binding)
(advice-add '+fold/previous :override #'ignore)

;; HACK :: sometimes cursor stays int normal-mode (even though we are in insert mode).  this fixes the inconsistency.
(setq-hook! 'minibuffer-setup-hook cursor-type 'bar)
;; evil-mode:2 ends here

;; [[file:config.org::*evil-mode][evil-mode:3]]
(dolist (cmd '(flycheck-next-error
		 flycheck-previous-error
		 +lookup/definition
		 +lookup/references
		 +lookup/implementations
		 +default/search-buffer
		 consult-imenu))
  (evil-add-command-properties cmd :jump t))

(dolist (cmd '(evil-backward-section-begin
		 evil-forward-section-begin
		 evil-jump-item
		 evil-backward-paragraph
		 evil-forward-paragraph
		 evil-forward-section-end))
  (evil-remove-command-properties cmd :jump))
;; evil-mode:3 ends here

;; [[file:config.org::*evil-mode][evil-mode:4]]
(defadvice! u/update-last-macro-register (fn &rest args)
  "when a macro was recorded and `evil-last-register' is still `nil' (no macro was executed yet),
  set it to the just recorded macro.

this is the sane default behaviour for 99% of the time: record a quick macro with 'qq' and
immediately call it with '@@', instead of getting an error, getting annoyed and having to retype
'@q' (the exact key) for the first time and then only after that we may call '@@'."
  :after #'evil-record-macro
  (when (not evil-last-register)
    (setq evil-last-register evil-last-recorded-register)))
;; evil-mode:4 ends here

;; [[file:config.org::*evil-mode][evil-mode:5]]
(after! savehist
  (add-to-list 'savehist-additional-variables 'evil-markers-alist)

  (add-hook! 'savehist-save-hook
    (kill-local-variable 'evil-markers-alist)
    (dolist (entry evil-markers-alist)
      (when (->> (cdr entry)
		 markerp)
	(setcdr entry
		(cons (->> entry
			   cdr
			   marker-buffer
			   buffer-file-name
			   file-truename)
		      (->> entry
			   cdr
			   marker-position))))))

  (add-hook! 'savehist-mode-hook
    (setq-default evil-markers-alist evil-markers-alist)
    (kill-local-variable 'evil-markers-alist)
    (make-local-variable 'evil-markers-alist)))
;; evil-mode:5 ends here

;; [[file:config.org::*evil-mode][evil-mode:6]]
)
;; evil-mode:6 ends here
