config/.config/doom/config.org
** leaderkey
#+begin_src elisp
(setq doom-leader-key "SPC"
      doom-leader-alt-key "C-SPC"
      doom-localleader-key "SPC m")

(map! :leader
      (:prefix "h"
               "w" #'tldr)
      (:prefix "s"
               "k" #'devdocs-lookup
               "t" #'dictionary-search)
      (:prefix "f"
               "f" #'+vertico/consult-fd-or-find)
      (:prefix "t"
	       "a" #'toggle-text-mode-auto-fill)
      (:prefix "c"
               "r" #'lsp-rename
               (:prefix "'"
                        "t" #'org-babel-tangle
                        "T" #'org-babel-detangle))
      (:prefix "n"
               "g" #'org-capture-goto-last-stored))
#+end_src

** completion & minibuffer
- completion keybindings :: use [[kbd:C-n][C-n]] for code autocompletion.  use [[kbd:C-p][C-p]] for abbreviations (which is logical since the expansion is most likely to be above the current code position)  finally, if we want to expand a snippet, or move through completion fields, use [[kbd:tab][tab]].  once autocompletion is activated, we use [[kbd:][C-n/p]] to navigate candidates.
- vertico-flat-mode :: less distracting and more focused.  it promotes finding items not by navigating via scrolling through candidates, but instead by searching.  we don't need a fancy popup everytime we want to switch to a candidate, we only want to know when the completion matches, since we already know beforehand what we are looking for.  (it is consistent with dmenu/rofi's appearance).   we use the same bindings for navigating the candidates as for completion (consistency!): [[kbd:C-n/p][C-n/p]]
- history :: [[kbd:][j, k, /, RET]]  as a evil-style ergonomic default.  ~evil~ expects us to use unergonomic/inaccessible [[kbd:][up, down]] by default.  (for ~comint-mode~ we must use [[kbd:][ctrl-n/p]] since it is a regular buffer).

#+begin_src elisp
(map! :map minibuffer-mode-map
      :n "j"   #'next-history-element
      :n "k"   #'previous-history-element
      :n "/"   #'previous-matching-history-element
      :n "RET" #'exit-minibuffer
      :i "C-n" #'completion-at-point)

(map! :map evil-ex-search-keymap :after evil
      :n "j"   #'next-history-element
      :n "k"   #'previous-history-element
      :n "/"   #'previous-matching-history-element
      :n "RET" #'exit-minibuffer)

(map! :map vertico-map :after vertico
      :n "j"   #'next-history-element
      :n "k"   #'previous-history-element
      :n "/"   #'previous-matching-history-element
      :n "RET" #'vertico-exit
      :i "C-n" #'next-line-or-history-element
      :i "C-p" #'previous-line-or-history-element)

(map! :map vertico-map
      :im "C-w" #'vertico-directory-delete-word ;; HACK :: must bind again (smarter C-w)
      :im "C-d" #'consult-dir
      :im "C-f" #'consult-dir-jump-file)

(map! :map company-mode-map :after company
      :i "C-n" #'company-complete)

(map! :map comint-mode-map :after comint
      :i "C-r" #'comint-history-isearch-backward-regexp)

;; not defined :(
(map! :map cider-repl-mode-map :after cider-repl
      :n "C-j" #'cider-repl-next-prompt
      :n "C-k" #'cider-repl-previous-prompt
      :n "C-n" #'cider-repl-next-input
      :n "C-p" #'cider-repl-previous-input
      :i "C-r" #'cider-repl-previous-matching-input)
#+end_src

in search/replace minibuffers we want C-p to work as in evil buffer's: to expand matches of the buffer.  C-n is still mapped to 'minibuffer-complete'.  this allows us to eg. quickly replace the symbol at 'point'.
#+begin_src elisp
;; HACK :: '(1) since evil-complete-previous-func expects an arg.
(setq evil-complete-previous-minibuffer-func
      #'(lambda () (apply evil-complete-previous-func '(1))))
#+end_src

** editing
- goal :: make vim's bindings even more mnemonic/sane/sensible/efficient and improve consistency of implementation.
- useless default mappings :: remap underused/useless keys to statistically frequently used commands.
- fundamentals :: we don't change fundamental bindings of vi(m), we improve on them, as to retain muscle memory and consistency in other applications (eg. ~viper-mode~, vim emulations).
- [[kbd:][L]] :: inverse of: [[kbd:][L]], ~electric-newline-and-indent~.  this is really convenient to eg. split function arguments onto newlines.
- & :: for running quick one-off shell commands we need a primary mapping (for anthing more, switch over to ~shell~).  (evil's: ~&~ is useless, since we use ~query-replace-regexp~ instead of ~evil-ex~).
- [[kbd:][C-j/k]] :: navigate by sections.  these bindings are implemented in ~magit~, ~info-mode~, ~man~, ~org-mode~.
- [[kbd:][_]] :: default mapping is useless (use [[kbd:][^]]).  is mapped to the commonly used (but unergonomic) [[kbd:]["_d]] to delete into the ~null-register~.

#+begin_src elisp
(map! :after evil
      :nm "&"   #'async-shell-command ;; consistent with dired, shell...
      :n  "L"   #'newline-and-indent
      :n  "_"   (cmd! (evil-use-register ?_)
		      (call-interactively #'evil-delete))

      ;; more sensible & ergonomic than `C-x/C-a', `+-' in vim is useless anyways.
      :n  "+"   #'evil-numbers/inc-at-pt
      :n  "-"   #'evil-numbers/dec-at-pt
      :n  "g+"  #'evil-numbers/inc-at-pt-incremental
      :n  "g-"  #'evil-numbers/dec-at-pt-incremental)
#+end_src

- HACK :: map [[kbd:][C-h]] to [[kbd:][backspace]] consistently (some modes don't respect ~evil-want-C-h-delete~).
#+begin_src elisp
(define-key! key-translation-map "C-h" "DEL")
#+end_src

- we often use long lines in prose with ~visual-fill-column-mode~.
- [[kbd:][gj, gk]] :: respect evil's fundamentally neccessary bindings.
#+begin_src elisp
(map! :map evil-org-mode-map :after evil-org
      :n "gj"  #'evil-next-visual-line
      :n "gk"  #'evil-previous-visual-line

      :n "C-j" #'org-next-visible-heading
      :n "C-k" #'org-previous-visible-heading)
#+end_src

- we use [[kbd:][C-l]] over [[kbd:][zz]] (same as shell + [[kbd:][ctrl]] bindings are already for screen-movements: [[kbd:][C-u/d/e/y]]), but ~c~ modes don't respect it.
#+begin_src elisp
(map! :map (c-mode-map cpp-mode-map c++-mode-map)
      :nm "C-l" #'recenter-top-bottom)
#+end_src

- close popup window (eg. ~*lsp-help*~) from the main window with [[kbd:][escape]] in normal mode.  (ergonomic & fast)
- since we don't split we only need to occasionally switch window, and [[kbd:][C-w]] is just one keypress to many.  (additionally we also want to jump in/out of minbuffer window if it is active).
#+begin_src elisp
(add-hook! 'doom-escape-hook #'delete-other-windows)

(map! :after evil
      :nm "C-w" #'next-window-any-frame)
#+end_src

*** embrace emacs
- don't use vim's commandline: ~evil-ex~, instead just use emacs ~M-x~.  this introduces and additional layer of unneccessary complexity.  we use only the vim-motions, for all other things, emacs tools are more powerful.
  - :%s/ :: use emacs-native ~query-replace-regex~ instead, which is more interactive, powerful and flexible than vim's replacement.  it has undo, navigating matches, and can even transfor the match using arbitrary lisp code (see help: ~query-replace-regex~).
    - tip :: use ~C-r C-w/C-a~ to insert the inside-word/around-word under point in the main-buffer (vim feature).
  - :g :: use emacs ~reverse-region~, ~delete-lines~ and macros.
  - other commands such as ~:w~, ~:q~, ~:b~, ~:e~ etc. should be executed more ergonomically/efficiently by top-level keybindings (using [[kbd:][ctrl]]) anyways.
- [[kbd:][Q]] :: ~query-replace~ needs to be easily accessible (used all the time for renaming var's etc.) so it gets a top level binding and has directional forward/backward mapping like vim's: ~/?~.  (same as in ~viper-mode~) - [remap] :: use `remap' to replace function with enhanced ones that have the same functionality (thus keeping the binding's consistency).

#+begin_src elisp
(define-key! [remap evil-ex] #'execute-extended-command)

(map! :after evil
      :n "Q" #'u/query-replace-regexp-op)

(evil-define-operator u/query-replace-regexp-op (beg end type)
  "make (anzu)`query-replace-regexp' into an operator acting only on defined region."
  :restore-point t
  (interactive "<R>")
  (let ((region-start (save-excursion (goto-char beg) (point)))
        (region-end (save-excursion (goto-char end) (point))))

    (save-restriction
      (narrow-to-region region-start region-end)
      (call-interactively 'anzu-query-replace-regexp))))
#+end_src

- get feedback when ~query-replacing~ (since we don't use evil's ~:s/~, but instead emac's native ~query-replace-regexp~)
#+begin_src elisp
(global-anzu-mode)
(define-key! [remap query-replace] #'anzu-query-replace)
(define-key! [remap query-replace-regexp] #'anzu-query-replace-regexp)
#+end_src

*** no visual selections
- efficiency :: after spending considerable amounts of time using emacs with ~viper-mode~ (~vi~ has no visual selections), i came to the conclusion that using ~visual-mode~ in ~vim~ actually encourages less efficient behaviour (manually selecting text even though a motion would have been more efficient).
- motions :: we are faster & more efficient enforcing the usage of motions, prefix-number commands and ~evil-repeat~.  instead of visual line mode, use a number prefix argument like ~3dj, 3yap, 3ck~.  if we can't use a textobject (eg: braces, word, paragraph, sentence...).  just use ~<operator>~ + ~incsearch~ to act upto the position that we want.  (eg: ~d /~)
- viper-mode compatibility :: additionally it comes with the benefit of making our workflow more compatible if we are working on a different setup without doom, and only vanilla emacs+viper-mode (or just ~vi~ on a server) is available.
- emergency :: if all fails and we must use a visual selection, we may still use [[kbd:][C-space]] (emacs binding).
- paste replace :: to replace some text with yanked text (normally we would visually select that region (again, unefficient) and then paste over it).  we can use these equally efficient methods:
  a. delete the content and then use =yank-register=: ~"0p~ to paste
  b. use ~"_d~ to delete using the =null-register= and the paste normally.
  c. delete, paste, then use [[kbd:][C-p]] to cycle the kill ring back to the yanked text.
- ~evil-visual-block~ :: still enabled, since this is still a efficient gap bridger between editin multiple lines before switching to macros.

#+begin_src elisp
(define-key! [remap evil-visual-char] #'ignore)
(define-key! [remap evil-visual-line] #'ignore)
#+end_src

- we map the valuable top level key to the statistically most frequently used non-editing commands.
  (see: [[http://xahlee.info/emacs/emacs/command-frequency.html][emacs command frequency statistics]]).
- using ~find-file~ frequently.  to change dir's for the ~shell~/~dired~, jump to dired in current directory with it, creating new files ...
#+begin_src elisp
(map! :map 'override
      :nm "v" #'basic-save-buffer
      :nm "V" #'find-file)
#+end_src

