config/.config/doom/config.el

;; [[file:config.org::*leaderkey][leaderkey:1]]
(setq doom-leader-key "SPC"
      doom-leader-alt-key "C-SPC"
      doom-localleader-key "SPC m")

(map! :leader
      (:prefix "h"
               "w" #'tldr)
      (:prefix "s"
               "k" #'devdocs-lookup
               "t" #'dictionary-search)
      (:prefix "f"
               "f" #'+vertico/consult-fd-or-find)
      (:prefix "t"
	       "a" #'toggle-text-mode-auto-fill)
      (:prefix "c"
               "r" #'lsp-rename
               (:prefix "'"
                        "t" #'org-babel-tangle
                        "T" #'org-babel-detangle))
      (:prefix "n"
               "g" #'org-capture-goto-last-stored))
;; leaderkey:1 ends here

;; [[file:config.org::*completion & minibuffer][completion & minibuffer:1]]
(map! :map minibuffer-mode-map
      :n "j"   #'next-history-element
      :n "k"   #'previous-history-element
      :n "/"   #'previous-matching-history-element
      :n "RET" #'exit-minibuffer
      :i "C-n" #'completion-at-point)

(map! :map evil-ex-search-keymap :after evil
      :n "j"   #'next-history-element
      :n "k"   #'previous-history-element
      :n "/"   #'previous-matching-history-element
      :n "RET" #'exit-minibuffer)

(map! :map vertico-map :after vertico
      :n "j"   #'next-history-element
      :n "k"   #'previous-history-element
      :n "/"   #'previous-matching-history-element
      :n "RET" #'vertico-exit
      :i "C-n" #'next-line-or-history-element
      :i "C-p" #'previous-line-or-history-element)

(map! :map vertico-map
      :im "C-w" #'vertico-directory-delete-word ;; HACK :: must bind again (smarter C-w)
      :im "C-d" #'consult-dir
      :im "C-f" #'consult-dir-jump-file)

(map! :map company-mode-map :after company
      :i "C-n" #'company-complete)

(map! :map comint-mode-map :after comint
      :i "C-r" #'comint-history-isearch-backward-regexp)

;; not defined :(
(map! :map cider-repl-mode-map :after cider-repl
      :n "C-j" #'cider-repl-next-prompt
      :n "C-k" #'cider-repl-previous-prompt
      :n "C-n" #'cider-repl-next-input
      :n "C-p" #'cider-repl-previous-input
      :i "C-r" #'cider-repl-previous-matching-input)
;; completion & minibuffer:1 ends here

;; [[file:config.org::*completion & minibuffer][completion & minibuffer:2]]
;; HACK :: '(1) since evil-complete-previous-func expects an arg.
(setq evil-complete-previous-minibuffer-func
      #'(lambda () (apply evil-complete-previous-func '(1))))
;; completion & minibuffer:2 ends here

;; [[file:config.org::*editing][editing:1]]
(map! :after evil
      :nm "&"   #'async-shell-command ;; consistent with dired, shell...
      :n  "L"   #'newline-and-indent
      :n  "_"   (cmd! (evil-use-register ?_)
		      (call-interactively #'evil-delete))

      ;; more sensible & ergonomic than `C-x/C-a', `+-' in vim is useless anyways.
      :n  "+"   #'evil-numbers/inc-at-pt
      :n  "-"   #'evil-numbers/dec-at-pt
      :n  "g+"  #'evil-numbers/inc-at-pt-incremental
      :n  "g-"  #'evil-numbers/dec-at-pt-incremental)
;; editing:1 ends here

;; [[file:config.org::*editing][editing:2]]
(define-key! key-translation-map "C-h" "DEL")
;; editing:2 ends here

;; [[file:config.org::*editing][editing:3]]
(map! :map evil-org-mode-map :after evil-org
      :n "gj"  #'evil-next-visual-line
      :n "gk"  #'evil-previous-visual-line

      :n "C-j" #'org-next-visible-heading
      :n "C-k" #'org-previous-visible-heading)
;; editing:3 ends here

;; [[file:config.org::*editing][editing:4]]
(map! :map (c-mode-map cpp-mode-map c++-mode-map)
      :nm "C-l" #'recenter-top-bottom)
;; editing:4 ends here

;; [[file:config.org::*editing][editing:5]]
(add-hook! 'doom-escape-hook #'delete-other-windows)

(map! :after evil
      :nm "C-w" #'next-window-any-frame)
;; editing:5 ends here

;; [[file:config.org::*embrace emacs][embrace emacs:1]]
(define-key! [remap evil-ex] #'execute-extended-command)

(map! :after evil
      :n "Q" #'u/query-replace-regexp-op)

(evil-define-operator u/query-replace-regexp-op (beg end type)
  "make (anzu)`query-replace-regexp' into an operator acting only on defined region."
  :restore-point t
  (interactive "<R>")
  (let ((region-start (save-excursion (goto-char beg) (point)))
        (region-end (save-excursion (goto-char end) (point))))

    (save-restriction
      (narrow-to-region region-start region-end)
      (call-interactively 'anzu-query-replace-regexp))))
;; embrace emacs:1 ends here

;; [[file:config.org::*embrace emacs][embrace emacs:2]]
(global-anzu-mode)
(define-key! [remap query-replace] #'anzu-query-replace)
(define-key! [remap query-replace-regexp] #'anzu-query-replace-regexp)
;; embrace emacs:2 ends here

;; [[file:config.org::*no visual selections][no visual selections:1]]
(define-key! [remap evil-visual-char] #'ignore)
(define-key! [remap evil-visual-line] #'ignore)
;; no visual selections:1 ends here

;; [[file:config.org::*no visual selections][no visual selections:2]]
(map! :map 'override
      :nm "v" #'basic-save-buffer
      :nm "V" #'find-file)
;; no visual selections:2 ends here

;; [[file:config.org::*surround][surround:1]]
(map! :after evil
