config/.config/doom/config.org
*** surround
- s/S :: vim's ~s, S~ is useless, since they are duplicates of: ~x, C~.  we introduce ~evil-surround~ operator.  it is very powerful, we always delete/add on surrounding pairs.  it directly extends evil's text editing workflow.
  - readme: https://github.com/emacs-evil/evil-surround
#+begin_src elisp
(map! :after evil
      :n "s" #'evil-surround-region
      :n "S" #'evil-Surround-region)

(after! evil-surround
  (add-to-list 'evil-surround-pairs-alist '(?` . ("`" . "`")))

  (add-hook! 'org-mode-hook :local
    (add-to-list 'evil-surround-pairs-alist '(?~ . ("~" . "~")))))
#+end_src

*** smartparens
#+begin_src elisp
(after! smartparens
  (setq sp-ignore-modes-list '()) ;; disable nowhere (consistency!)
  (->> (sp-local-pair "~" "~")
   (sp-with-modes 'org-mode)))
#+end_src

*** lispy(ville): editing lisp in vim
- makes vim's motions dwim in lisp modes (mainly respecting parenthesis).
- key-themes :: give me all the lispyville editing power but only the ones consistent with evil's modal editing.  which means not enabling [[kbd:][M-]] key-bindings ([[kbd:][M-]] is reserved for WM).
#+begin_src elisp
(add-hook! '(emacs-lisp-mode-hook
	     lisp-mode-hook
	     clojure-mode-hook
	     cider-repl-mode-hook)
	   #'lispyville-mode)

;; call help on `lispyville-set-key-theme' to see what is bound.
(after! lispyville
  (lispyville-set-key-theme '(operators
                              insert
                              c-w
                              c-u
                              prettify
                              text-objects
                              commentary
                              slurp/barf-lispy)))
#+end_src

some selective mappings of disabled keythemes
- [[kbd:][U]] :: "up"
- [[kbd:][()]] :: navigate to beginning/end of current sexp.  very useful!
#+begin_src elisp
(map! :map lispyville-mode-map :after lispyville
      :nm "U" #'lispyville-raise-list

      :nm "(" #'lispyville-backward-up-list
      :nm ")" #'lispyville-up-list)
#+end_src

** harpoon
- when in a codebase/project, of no matter what size, this is the msot efficient way of navgating the files/buffers one finds themselves alternating between.  this is for when ~switch-to-buffer~, and fuzzy-finding are just too many keystrokes and repetetively used and ~evil-switch-to-windows-last-buffer~ just isn't enough, since we need to alternate between more than 2 file.
- we are restrained to 4 files since that is all we'll need and generally, if we have more than that, we have too much mental overhead remembering which files are where.  4 seem's to be generally the limit for us, for which we can subconsiously switch back and forth inbetween.
- we use [[kbd:][SPC m]] and [[kbd:][M]] since harpoon marks are conceptually similar to vim marks.  (harpoon hydra goes against emacs philosophy, use harpoon-toggle-file, is way more intuitive)
- REPL-buffer :: for repl-coupled languages (python, shell, clojure) we already have efficient bindings to jump back and forth between the ~REPL~ / ~shell~ buffer and our file(s).  (on ~localleader~ map for the mode).
- compilation-buffer :: in any projects that we compile, we frequently switch to the ~*compilation*~ buffer.  since this is a consistently repeating action, we make it efficient.
- bindings are consistent with the webbrowser (switch tabs using [[kbd:][M-<number]])
#+begin_src elisp
(use-package! harpoon
  :config
  (setq harpoon-separate-by-branch nil) ;; simple repos
  (map! :map 'override
	:nm "M-1" #'harpoon-go-to-1
	:nm "M-2" #'harpoon-go-to-2
	:nm "M-3" #'harpoon-go-to-3
	:nm "M-4" #'harpoon-go-to-4

	:nm "M-6" (cmd! (switch-to-buffer next-error-last-buffer))

        :nm "M"   #'harpoon-add-file)

  (map! :leader "M" #'harpoon-toggle-file)

  ;; exit like in help, magit, dired...
  (map! :map harpoon-mode-map :after harpoon
        :nm "q" #'kill-current-buffer)

  ;; show abs. line numbers to indicate the bindings.
  (setq-hook! 'harpoon-mode-hook display-line-numbers t))
#+end_src

 - [[kbd:][TAB]] :: we frequently alternate between 2 bufers in rapid succession (especially since we don't use splits), and we follow the OS consistent binding.
 (additionally evil's [[kbd:][C-6]] is not mnemonic, nor ergonomic)

in modes like ~org~, ~magit~, where [[kbd:][TAB]] is normally used for folding, we should by using the more precise evil fold-prefix: [[kbd:][z]]
#+begin_src elisp
(map! :map 'override
      :nm "<tab>" #'evil-switch-to-windows-last-buffer) ;; HACK :: must be <tab> not TAB to properly override

 ;; +org/toggle-fold ins incomplete (don't work with org-blocks/ LOG)
(define-key! [remap +org/toggle-fold] #'org-cycle)
#+end_src

* occur: emacs interactive grep
- occur :: use it like grep, to compactly view only maching lines.  additionally it is a powerful interactive search & replace tool.  (edit the matching lines buffer interactively, for more power combined the editing using macros).
#+begin_src elisp
(map! :map occur-mode-map :after replace
      :n "q" #'quit-window) ;; consistent with other read-only modes (magit, dired, docs...)

(map! :after evil
      :nm "g/"  #'occur)
#+end_src

* dired
- avoid using integrated filemanagers and manually navigating directory structures (such as dired / ranger / thunar) whenever possible (and dont even dare to suggest a gui file manager...).
- if we think we need a sidebar type file explorer, we are doing something terribly inefficient in our workflow.
- use a fileexplorer mostly for getting an overview of a directory and to manipulate files in that directory.
- it's more efficient, faster and extensible using search & completion tools, such as emacs: find-file, fuzzy finding and using harpoon-marks, global-marks and bookmarks for switching to other directories and files.
- ditch spamming [[kbd:hjkl][hjkl]] to navigate nested directories fore directly goto to the file we are looking for.
- hide details (visual clutter) by default.  show explicitly when neccessary.

#+begin_src elisp
(after! dired
   ;; prevent hidden edits
  (add-hook! 'wdired-mode-hook
    (dired-hide-details-mode -1)
    (dired-omit-mode -1))

  ;; open graphical files externally
  (setq dired-open-extensions (mapcan (lambda (pair)
                                        (let ((extensions (car pair))
                                              (app (cdr pair)))
                                          (mapcar (lambda (ext)
                                                    (cons ext app))
                                                  extensions)))
                                      '((("mkv" "webm" "mp4" "mp3") . "mpv")
                                        (("pdf")                    . "zathura")
                                        (("gif" "jpg" "png")        . "feh")
                                        (("docx" "odt" "odf")       . "libreoffice")))
        dired-recursive-copies 'always
        dired-recursive-deletes 'always
        dired-no-confirm '(uncompress move copy)
        dired-omit-files "^\\..*$")

  (define-key! [remap dired-find-file] #'dired-open-file)) ;; try dired-open fn's (no success => call: `dired-find-file')
#+end_src

** dired/keybindings
- filemanagers :: avoid using integrated filemanagers (such as dired / ranger / lf) whenever possible replace them with shell commands and fuzzy-finding (in project/root/recentfiles)
- in most cases it is more extensible and faster using tools such as emacs find-file in combination with fuzzy finding and using global bookmarks for frequently used projects/files.
- create new files/dir's using ~find-file~ instead of ~dired-create-empty-file~ (inserts filetemplate properly)
#+begin_src elisp
(map! :map dired-mode-map :after dired
      :m "h" #'dired-up-directory) ;; navigate using hjkl
#+end_src

- hide details & hidden files by default (visual distracting clutter).  enable all details if needed.
#+begin_src elisp
(defun u/dired-hide-all ()
  (dired-hide-details-mode)
  (dired-omit-mode))

 ;; HACK :: enabled by default, but we don't want duplicate hooks
(remove-hook! 'dired-mode-hook #'dired-omit-mode)
(add-hook! 'dired-mode-hook #'u/dired-hide-all)

(map! :map dired-mode-map :localleader :after dired-x
      :desc "dired-hide-details" "h" (cmd! (apply (if (memq 'u/dired-hide-all dired-mode-hook)
						      #'remove-hook
						    #'add-hook)
						  '(dired-mode-hook
						    u/dired-hide-all))

					   (call-interactively #'dired-omit-mode)
					   (call-interactively #'dired-hide-details-mode)))
#+end_src


** archive file
- archive all things that were once written or created (instead of deleting them) => digital content cost's little to no space.  and one shall be grateful later in life to have recorded data (that can be analyzed & crunched) what one was thinking.
- this ensures a predictable and consistent archiving scheme (archive to original path under archive)
#+begin_src elisp
(defvar u/archive-dir "~/Archive/")

(defun u/dired-archive ()
  "`mv' marked file/s to: `u/archive-dir'/{relative-filepath-to-HOME}/{filename}"
  (interactive)

  (mapc (lambda (file)
          (let* ((dest (file-name-concat u/archive-dir
					 (concat (->> "~/"
						      (file-relative-name file)
						      file-name-sans-extension)
						 "_archived_"
						 (format-time-string "%F_T%H-%M-%S")
						 (when (file-name-extension file)
						   (->> file
							file-name-extension
							(concat "."))))))
                 (dir (file-name-directory dest)))

            (unless (file-exists-p dir)
              (make-directory dir t))
            (rename-file file dest 1)))
        (dired-get-marked-files nil nil))

  (revert-buffer))

(map! :map dired-mode-map :localleader
      "a" #'u/dired-archive)
#+end_src

