config/.config/doom/config.el
      :n "s" #'evil-surround-region
      :n "S" #'evil-Surround-region)

(after! evil-surround
  (add-to-list 'evil-surround-pairs-alist '(?` . ("`" . "`")))

  (add-hook! 'org-mode-hook :local
    (add-to-list 'evil-surround-pairs-alist '(?~ . ("~" . "~")))))
;; surround:1 ends here

;; [[file:config.org::*smartparens][smartparens:1]]
(after! smartparens
  (setq sp-ignore-modes-list '()) ;; disable nowhere (consistency!)
  (->> (sp-local-pair "~" "~")
   (sp-with-modes 'org-mode)))
;; smartparens:1 ends here

;; [[file:config.org::*lispy(ville): editing lisp in vim][lispy(ville): editing lisp in vim:1]]
(add-hook! '(emacs-lisp-mode-hook
	     lisp-mode-hook
	     clojure-mode-hook
	     cider-repl-mode-hook)
	   #'lispyville-mode)

;; call help on `lispyville-set-key-theme' to see what is bound.
(after! lispyville
  (lispyville-set-key-theme '(operators
                              insert
                              c-w
                              c-u
                              prettify
                              text-objects
                              commentary
                              slurp/barf-lispy)))
;; lispy(ville): editing lisp in vim:1 ends here

;; [[file:config.org::*lispy(ville): editing lisp in vim][lispy(ville): editing lisp in vim:2]]
(map! :map lispyville-mode-map :after lispyville
      :nm "U" #'lispyville-raise-list

      :nm "(" #'lispyville-backward-up-list
      :nm ")" #'lispyville-up-list)
;; lispy(ville): editing lisp in vim:2 ends here

;; [[file:config.org::*harpoon][harpoon:1]]
(use-package! harpoon
  :config
  (setq harpoon-separate-by-branch nil) ;; simple repos
  (map! :map 'override
	:nm "M-1" #'harpoon-go-to-1
	:nm "M-2" #'harpoon-go-to-2
	:nm "M-3" #'harpoon-go-to-3
	:nm "M-4" #'harpoon-go-to-4

	:nm "M-6" (cmd! (switch-to-buffer next-error-last-buffer))

        :nm "M"   #'harpoon-add-file)

  (map! :leader "M" #'harpoon-toggle-file)

  ;; exit like in help, magit, dired...
  (map! :map harpoon-mode-map :after harpoon
        :nm "q" #'kill-current-buffer)

  ;; show abs. line numbers to indicate the bindings.
  (setq-hook! 'harpoon-mode-hook display-line-numbers t))
;; harpoon:1 ends here

;; [[file:config.org::*harpoon][harpoon:2]]
(map! :map 'override
      :nm "<tab>" #'evil-switch-to-windows-last-buffer) ;; HACK :: must be <tab> not TAB to properly override

 ;; +org/toggle-fold ins incomplete (don't work with org-blocks/ LOG)
(define-key! [remap +org/toggle-fold] #'org-cycle)
;; harpoon:2 ends here

;; [[file:config.org::*occur: emacs interactive grep][occur: emacs interactive grep:1]]
(map! :map occur-mode-map :after replace
      :n "q" #'quit-window) ;; consistent with other read-only modes (magit, dired, docs...)

(map! :after evil
      :nm "g/"  #'occur)
;; occur: emacs interactive grep:1 ends here

;; [[file:config.org::*dired][dired:1]]
(after! dired
   ;; prevent hidden edits
  (add-hook! 'wdired-mode-hook
    (dired-hide-details-mode -1)
    (dired-omit-mode -1))

  ;; open graphical files externally
  (setq dired-open-extensions (mapcan (lambda (pair)
                                        (let ((extensions (car pair))
                                              (app (cdr pair)))
                                          (mapcar (lambda (ext)
                                                    (cons ext app))
                                                  extensions)))
                                      '((("mkv" "webm" "mp4" "mp3") . "mpv")
                                        (("pdf")                    . "zathura")
                                        (("gif" "jpg" "png")        . "feh")
                                        (("docx" "odt" "odf")       . "libreoffice")))
        dired-recursive-copies 'always
        dired-recursive-deletes 'always
        dired-no-confirm '(uncompress move copy)
        dired-omit-files "^\\..*$")

  (define-key! [remap dired-find-file] #'dired-open-file)) ;; try dired-open fn's (no success => call: `dired-find-file')
;; dired:1 ends here

;; [[file:config.org::*dired/keybindings][dired/keybindings:1]]
(map! :map dired-mode-map :after dired
      :m "h" #'dired-up-directory) ;; navigate using hjkl
;; dired/keybindings:1 ends here

;; [[file:config.org::*dired/keybindings][dired/keybindings:2]]
(defun u/dired-hide-all ()
  (dired-hide-details-mode)
  (dired-omit-mode))

 ;; HACK :: enabled by default, but we don't want duplicate hooks
(remove-hook! 'dired-mode-hook #'dired-omit-mode)
(add-hook! 'dired-mode-hook #'u/dired-hide-all)

(map! :map dired-mode-map :localleader :after dired-x
      :desc "dired-hide-details" "h" (cmd! (apply (if (memq 'u/dired-hide-all dired-mode-hook)
						      #'remove-hook
						    #'add-hook)
						  '(dired-mode-hook
						    u/dired-hide-all))

					   (call-interactively #'dired-omit-mode)
					   (call-interactively #'dired-hide-details-mode)))
;; dired/keybindings:2 ends here

;; [[file:config.org::*archive file][archive file:1]]
(defvar u/archive-dir "~/Archive/")

(defun u/dired-archive ()
  "`mv' marked file/s to: `u/archive-dir'/{relative-filepath-to-HOME}/{filename}"
  (interactive)

  (mapc (lambda (file)
          (let* ((dest (file-name-concat u/archive-dir
					 (concat (->> "~/"
						      (file-relative-name file)
						      file-name-sans-extension)
						 "_archived_"
						 (format-time-string "%F_T%H-%M-%S")
						 (when (file-name-extension file)
						   (->> file
							file-name-extension
							(concat "."))))))
                 (dir (file-name-directory dest)))

            (unless (file-exists-p dir)
              (make-directory dir t))
            (rename-file file dest 1)))
        (dired-get-marked-files nil nil))

  (revert-buffer))

(map! :map dired-mode-map :localleader
      "a" #'u/dired-archive)
;; archive file:1 ends here

;; [[file:config.org::*org][org:1]]
(after! org
;; org:1 ends here

;; [[file:config.org::*options][options:1]]
(add-hook! 'org-mode-hook '(visual-line-mode
