config/.config/doom/config.org
** capture templates
- create capture-templates for organization on a per project basis, ex: university, personal, work..
- capture templates are used to collect & capture notes, events, tasks and templates; structured, tagged, sorted into a specific files.
- this ensures information based data is consistently captured.
- this is very customizeable and allows us to setup complex templates and should be used whenever we want to log data / repeatatively track things, or want to capture structured data with different entries consistently (eg: literature to track reading process).
- use the heading: ~inbox~ for collecting the captured tasks => can get messy, and can be refactored out of inbox into more structure if neccessary.
- for each project there is a separate folder (relative to org-dir) with files:
- agenda :: all tasks (todos, completed etc) and events (physical appointments)
- notes :: thoughts, exploration -> to study, to remember, to refactor
- set tags for entire file in the document-header with ~#+filetags: :proj:~
- motivation :: this scheme of =agenda/notes= is used to have a structured and consistent approach for generic projects-management.
- prepending :: if recent item's are of higher relevance
- appending :: for hierarchical order eg. book-quotes ordered from begin -> end

- implemented is a structured approach for generic projects, all using the same (but relative to project) paths and capture-templates.

#+begin_src elisp
(setq org-directory "~/Documents/org/")

  (defvar u/journal-dir (file-name-concat "~/Documents/journal/")
    "dir for daily captured journal files")

  (defvar u/literature-dir "~/Documents/literature"
    "literature sources and captured notes")

  (defvar u/literature-notes-dir (file-name-concat u/literature-dir "notes/")
    "note files for each literature source")

  (defvar u/wiki-dir "~/Documents/wiki/"
    "personal knowledge base directory :: cohesive, structured, standalone articles/guides.
(blueprints and additions to these articles are captured into 'org-directory/personal/notes.org',
and the later reviewed and merged into the corresponding article of the wiki.")

  (defvar u/doct-projects-default-templates '(u/doct-projects-task-template
					      u/doct-projects-event-template
					      u/doct-projects-note-template))

  (defvar u/doct-projects `(("cs" :keys "c"
                             :templates ,u/doct-projects-default-templates
                             :children (("ti"   :keys "t")
					("an2"  :keys "a")
					("ph1"  :keys "p")
					("spca" :keys "s" :templates (u/doct-projects-cc-src-template))
					("nm"   :keys "n" :templates (u/doct-projects-cc-src-template))))
                            ("personal" :keys "p" :templates ,u/doct-projects-default-templates)
                            ("config"   :keys "f" :templates ,u/doct-projects-default-templates))
    "same syntax as doct,  except for the key-value-pair: `:templates LIST`,
 where LIST is a list of functions with signature: `(PATH) -> VALID-DOCT-TEMPLATE`
 where PATH is to be generated by 'u/doct-projects-file'
 where TEMPLATE is a valid 'doct-capture-template'.
':templates' is inherited by the parent-group and if present in a childgroup it appends the
   additionally defined templates.")

  (defun u/doct-journal-file (&optional time)
    "returns a structured filename based on the current date.
eg: journal_2024-11-03.org
TIME :: time in day of note to return. (default: today)"
    (->> (current-time)
	 (or time)
	 (format-time-string "%F")
	 (format "journal_%s.org")
	 (file-name-concat u/journal-dir)))

  (defun u/doct-projects-file (type path)
    "TYPE :: 'agenda | 'notes"
    (->> type
	 symbol-name
	 (format "%s.org")
	 (file-name-concat org-directory path)))

  (defun u/doct-projects-task-template (path)
    (list "task"
          :keys "t"
          :file (u/doct-projects-file 'agenda path)
          :headline "inbox"
          :prepend t
          :empty-lines-after 1
          :template '("* [ ] %^{title}%?")))

  (defun u/doct-projects-event-template (path)
    (list "event"
          :keys "e"
          :file (u/doct-projects-file 'agenda path)
          :headline "events"
          :prepend t
          :empty-lines-after 1
          :template '("* [@] %^{title}%?"
                      "%^T"
                      ":PROPERTIES:"
                      ":REPEAT_TO_STATE: [@]" ; NOTE :: in case is made repeating
                      ":location: %^{location}"
                      ":material: %^{material}"
                      ":END:")))

  (defun u/doct-projects-note-template (path)
    (list "note"
          :keys "n"
          :file (u/doct-projects-file 'notes path)
          :prepend t
          :empty-lines-after 1
          :template '("* %^{title} %^g"
                      ":PROPERTIES:"
                      ":created: %U"
                      ":END:"
                      "%?")))

  (defun u/doct-projects-cc-src-template (path)
    "for quickly implementing/testing ideas (like a scratchpad, but have all
  our code-snippets in a single literate document, instead of creating a new file each time).  choose either c or c++.

`<<header>>' is org-babel's `:noweb' syntax and the named `org-src-block':
`c_header' (or `cpp_header') which must be present in the targetfile.  depending
on wether the project uses C or cpp it is different.  and should contains stuff
like `#include <iostream>' that is basically needed for every single snippet. "

    (list "note: src cc"
          :keys "s"
          :file (u/doct-projects-file 'notes path)
          :prepend t
          :empty-lines 1
          :template '("* %^{title} :%^{lang|C|C|cpp}:"
                      ":PROPERTIES:"
                      ":created: %U"
                      ":END:"
                      "#+begin_src %\\2"
                      "<<%\\2_header>>"
                      ""
                      "int main() {"
                      "        %?"
                      "}"
                      "#+end_src")))

  (defun u/doct-projects-expand-templates (projects &optional inherited-templates parent-path)
    "PROJECTS :: `u/doct-projects'
PARENT-PATH :: nil (used for recursion) "
    (mapcar (lambda (project)
              (let* ((tag (car project))
                     (props (cdr project))
                     (key (plist-get props :keys))
                     (self `(,tag :keys ,key))
                     (children (plist-get props :children))
                     (templates (append inherited-templates
					(plist-get props :templates)))
                     (path (file-name-concat parent-path tag)))

		(append self
			(if children
                            ;; HAS CHILDREN => is project-node => recursivly expand children
                            (list :children
                                  (append (u/doct-projects-expand-templates (list self)
									    templates)
                                          (u/doct-projects-expand-templates children
									    templates
									    path)))

                          ;; NO CHILDREN => is leaf-node => instantiate templates
                          (list :children
				(mapcar (lambda (fn-sym)
                                          (funcall fn-sym path))
                                        templates))))))
            projects))

  (setq org-capture-templates
	(doct `(;; PROJECT TEMPLATES
		,@(u/doct-projects-expand-templates u/doct-projects)

		;; NON-PROJECT TEMPLATES
		("journal"
		 :keys "j"

		 :file (lambda ()
			 (u/doct-journal-file))

		 :title (lambda ()
                          (->> (format-time-string "journal: %A, %e. %B %Y")
			       downcase))

		 :children (("journal init"
                             :keys "j"
                             :type plain
                             :template  ("#+title:  %{title}"
					 "#+author: %(user-full-name)"
					 "#+email:  %(message-user-mail-address)"
					 "#+date:   %<%F>"
					 "#+filetags: :journal:"
					 ""
					 "* goals"
					 "- [ ] %?"
					 ""
					 "* agenda"
					 "** [ ] "
					 ""
					 "* notes"))

                            ("note"
                             :keys "n"
                             :headline "notes"
                             :prepend t
                             :empty-lines-after 1
                             :template ("* %^{title}"
					":PROPERTIES:"
					":created: %U"
					":END:"
					"%?"))

                            ("yesterday review"
                             :keys "y"
                             :unnarrowed t

                             :file (lambda ()
				     (->> (days-to-time 1)
					  (time-subtract (current-time))
					  u/doct-journal-file))

                             :template ("* gratitude"
					"- %?"
					""
					"* reflection"
					"-"))))

		("literature"
		 :keys "l"

		 :file (lambda () (read-file-name "file: " u/literature-notes-dir))

		 :children (("add to readlist"
                             :keys "a"
                             :file ,(file-name-concat u/literature-dir "readlist.org")
                             :headline "inbox"
                             :prepend t
                             :template ("* [ ] %^{title}"))

                            ("init source"
                             :keys "i"

                             :file (lambda ()
                                     (->> (concat (->> (read-from-minibuffer "short title: ")
						       (replace-regexp-in-string " " "_"))
						  ".org")
					  (file-name-concat u/literature-notes-dir)))

                             :type plain

                             :template ("#+title:  %^{full title}"
					"#+author: %(user-full-name)"
					"#+email:  %(message-user-mail-address)"
					"#+date:   %<%F>"
					"#+filetags: :literature:%^g"
					""
					"* [-] %\\1%?"
					":PROPERTIES:"
					":title:  %\\1"
					":author: %^{author}"
					":year:   %^{year}"
					":type:   %^{type|book|book|textbook|book|paper|article|audiobook|podcast}"
					":pages:  %^{pages}"
					":END:")

                             :hook (lambda () (message "change task-state in readlist.org!")))

                            ("quote"
                             :keys "q"
                             :headline "quotes"
                             :empty-lines-before 1

                             :template ("* %^{title} [pg: %^{page}]"
					":PROPERTIES:"
					":created: %U"
					":END:"
					"#+begin_quote"
					"%?"
					"#+end_quote"))

                            ("note: literary"
                             :keys "l"
                             :headline "literature notes"
                             :empty-lines-before 1
                             :template ("* %^{title} [pg: %^{page}] %^g"
					":PROPERTIES:"
					":created: %U"
					":END:"
					"%?"))

                            ("note: transient"
                             :keys "t"
                             :headline "transient notes"
                             :empty-lines-before 1
                             :template ("* %^{title} %^g"
					":PROPERTIES:"
					":created: %U"
					":END:"
					"%?"))

                            ("summarize"
                             :keys "s"
                             :headline "summary"
                             :unnarrowed t
                             :type plain
                             :template ("%?")
                             :hook (lambda ()
                                     (message "change task-state!: TODO -> DONE")))))))) ;; in order to log finishing date
#+end_src

