config/.config/doom/config.org
** agenda
- multi-day-todo-events: add multiple timestamps on the same line => same task shows scheduled on different days.  ex:
- track which university lectures have been watched & reviewed.  => even if they are spread out onto multiple days => log all completions / review-notes under the same task.

#+begin_src elisp
(add-hook! 'org-agenda-mode-hook #'org-super-agenda-mode)

;; NOTE :: archive based on relative file path
(setq org-archive-location (file-name-concat u/archive-dir
					     "org"
					     "%s::")

	org-agenda-files (append (when (file-exists-p org-directory)
				   (directory-files-recursively org-directory
								org-agenda-file-regexp
								t))
				 ;; include tasks from {today's, yesterday's} journal's agenda
				 (->> (days-to-time 1)
				      (time-subtract (current-time))
				      u/doct-journal-file
				      (list (u/doct-journal-file))))

	org-agenda-skip-scheduled-if-done t
	;; org-agenda-sticky t
	org-agenda-skip-deadline-if-done t
	org-agenda-include-deadlines t
	org-agenda-tags-column 0
	org-agenda-block-separator ?─
	org-agenda-breadcrumbs-separator "…"
	org-agenda-compact-blocks nil
	org-agenda-show-future-repeats nil
	org-deadline-warning-days 3
	org-agenda-time-grid nil
	org-capture-use-agenda-date t)
#+end_src

#+begin_src elisp
(defadvice! u/add-newline (fn &rest args)
  "Separate dates in 'org-agenda' with newline."
  :around #'org-agenda-format-date-aligned
  (->> (apply fn args)
       (concat "\n")))
#+end_src

org-agenda by default is a clusterfuck.  this will clean it up: cleanly align everything into columns & group items.
+ achieve a nce and consistent readeable data-orinetated view
+ all task-states have the same length, otherwise there is no task-keyword alignment.
+ Set more concise & informing ~deadline~ & ~scheduled~ strings
#+begin_src elisp
(setq org-agenda-todo-keyword-format "%-3s"
      org-agenda-scheduled-leaders '("" "<< %1dd")

      org-agenda-deadline-leaders '("─────"
				    ">> %1dd"
				    "<< %1dd")

      org-agenda-prefix-format '((agenda . "%-20c%-7s%-7t") ;; all columns separated by minimum 2 spaces
				 (todo   . "%-20c%-7s%-7t")
				 (tags   . "%-20c%-7s%-7t")
				 (search . "%-20c%-7s%-7t")))
#+end_src

** org roam
#+begin_src elisp
(setq org-roam-directory u/wiki-dir)
#+end_src

** end org
- end of org section started with: ~after! org~
#+begin_src elisp
)
#+end_src

* dictionary
#+begin_src elisp
(after! dictionary
  (setq dictionary-server "dict.org"
        dictionary-default-dictionary "*"))
#+end_src

* devdocs
i always look up documentation/manuals within emacs.  (only if it's not sufficient do i resort to the browser/chatgpt)
#+begin_src elisp
(after! devdocs
  (setq devdocs-window-select t))

(setq-hook! 'java-mode-hook devdocs-current-docs '("openjdk~17"))
(setq-hook! 'c++-mode-hook devdocs-current-docs '("cpp" "eigen3"))
(setq-hook! 'c-mode-hook devdocs-current-docs '("c"))
(setq-hook! '(cider-mode-hook
	      cider-repl-mode-hook)
  devdocs-current-docs '("clojure~1.11"))
#+end_src

* whisper: transcription
we often formulate notes using transcription for speed and ergonomics.
always use ~evil-define-operator~ for ~evil-mode~ integration when defining routines to act on text.
#+begin_src elisp
(evil-define-operator u/reformat-prose (beg end)
  "we write all lowercase, all the time (to make the text more monotone, such that it's value will
speak more for it's self).  using the technical document convention of double space full stops for
legibility."
  (save-excursion
    (downcase-region beg end)
    (repunctuate-sentences t beg end)))

(add-hook! 'whisper-after-transcription-hook (u/reformat-prose (point-min) (point-max)))

(map! :leader "X" #'whisper-run)
#+end_src

* vertico: minibuffer completion
- i want a minimalist unobtrusive menu on the bottom of the frame, not a huge window popup disturbing my focus and workflow.
- this is consistent with rofi theme (or dmenu if using that).
#+begin_src elisp
(vertico-flat-mode)
#+end_src

* nov: ebooks
- uses variable pitch mode (serif font for reading)
- ~visual-line-mode~ and ~visual-fill-column~ mode to wrap line & center text
- o, outline :: which is more mnemonic (consistent with pdf-view-mode, info-mode, evil: 'imenu' outline when in code)
- q :: consistent with other read-only modes (magit, dired, docs...)
- SPC :: don't override leader-mode-binding
- line-spacing :: padding increases focus on current line for long prose text.
- screen-context-lines :: no confusing page overlaps, always start reading on the first visible line of the next page
#+begin_src elisp
(use-package! nov
  :mode ("\\.epub\\'" . nov-mode)
  :config
  (setq nov-variable-pitch t
        nov-text-width t)
  (advice-add 'nov-render-title :override #'ignore) ;; using modeline...

  (map! :map (nov-mode-map nov-button-map)
        "SPC" nil
        "C-SPC" nil
        :n "q" #'kill-current-buffer
        :n "o" #'nov-goto-toc

        ;; next/previous page
        :n "<next>" #'nov-scroll-up
        :n "<prior>" #'nov-scroll-down)

  (add-hook! 'nov-mode-hook
    (visual-fill-column-mode)
    (visual-line-mode)

    (setq-local next-screen-context-lines 0
                line-spacing 2)

    ;; HACK :: need to unset
    (setq-local global-hl-line-mode nil)
    (hl-line-mode -1)))
#+end_src

* company: code completion
- disable completion menu by default ::
  - i don't want company to show up and distract me when i already know exactly what i want.
  - make use of it only when we don't know the exact symbol name / function signature, or when typing overly long symbol-names becomes tedious.
  - this enforces more thoughtful coding, evaluating what the function actually does and let's us focus more on the semantics of the code.
  - it actually makes us faster, since it removes the mental overhead and interruption that arises from the distracting completion menu.  it has great impact on improving the overall typing speed.
  - it makes coding more raw, distractionfree, and overall more enjoyeable
#+begin_src elisp
(after! company
  (setq company-minimum-prefix-length 0
        company-idle-delay nil ;; only show menu when explicitly activated
        company-show-quick-access t))
#+end_src

* yas: snippets
- nested snippets ared good
#+begin_src elisp
(setq yas-triggers-in-field t)
#+end_src

* file templates
in each new file systematically insert heading metadata (as comments) with the following template
- append more neccessary info if needed (ex: ~dependencies:~)
#+begin_example
# ---
# title:  file metadata
# author: emil lenz
# email:  emillenz@protonmail.com
# date:   2024-01-06
# notes:
# - outlines file-metadata template, to be inserted at top of every file systematically.
# ---
#+end_example

- title :: full title of document.
- author :: document creator/"owner".
- email :: author's email
- for contacting him with question's / reaching out.
- date :: date of file creation, ISO8601 format.
- track our coding/writing progress over the years and just generally it is important to document the timing of things, to analyze/order/reconstruct them.
- info :: short document description/summary, think of it as a docstring for the file with this the reader should know what the document is about in one line.

we automate this repetetive task using a snippets.
#+begin_src elisp
(set-file-templates!
 '(org-mode :trigger "header")
 '(prog-mode :trigger "header")
 '(makefile-gmake-mode :ignore t))
#+end_src

* shell
- to start a emacs/shell-buffer independent process, use ~disown~.
- we never use an actual terminal, always use ~shell~ (to get benefits of comint mode).
- normal mode by default :: 99% of the time i want to navigate the compilation/shell buffer.  (and not read stdin in insert mode))
#+begin_src elisp
(after! comint
  (setq comint-process-echoes t))

;; browse
(after! shell
  (set-lookup-handlers! 'shell-mode :documentation '+sh-lookup-documentation-handler))

(add-to-list 'evil-normal-state-modes 'shell-mode)
#+end_src

* lsp
#+begin_src elisp
(after! lsp-mode
  ;; when we kill buffer's, don't prompt to restart the server...
  (setq lsp-restart 'ignore))
#+end_src

