config/.config/doom/config.org
* harpoon bugfix (PR open, override until accepted)
#+begin_src elisp
(after! harpoon
  (defadvice! u/harpoon-go-to (line-number)
    "Go to specific file on harpoon (by line order). LINE-NUMBER: Line to go."
    :override #'harpoon-go-to
    (require 'project)

    (let* ((harpoon-mode-p (eq major-mode 'harpoon-mode))

           (harpoon-file (if harpoon-mode-p
                             (file-truename (buffer-file-name))
                           (harpoon--file-name)))

           (file-name (s-replace-regexp "\n" ""
                                        (with-temp-buffer
                                          (insert-file-contents-literally harpoon-file)
                                          (goto-char (point-min))
                                          (forward-line (- line-number 1))
                                          (buffer-substring-no-properties (line-beginning-position)
                                                                          (line-end-position)))))

           (full-file-name (if (and (fboundp 'project-root)
                                    (harpoon--has-project))
                               (concat (or harpoon--project-path
                                           (harpoon-project-root-function))
                                       file-name)

                             file-name)))
      (if harpoon-mode-p
          (harpoon-find-file file-name)

        (if (file-exists-p full-file-name)
            (find-file full-file-name)

          (message (concat full-file-name " not found."))))))

  (defadvice! u/harpoon-find-file (&optional file-name)
    "Visit file on `harpoon-mode'."
    :override #'harpoon-find-file
    (interactive)

    (let* ((file-name (or file-name
                          (buffer-substring-no-properties (point-at-bol)
							  (point-at-eol))))
           (full-file-name (concat harpoon--project-path
				   file-name)))

      (if (file-exists-p full-file-name)
          (progn (save-buffer)
                 (kill-buffer)
                 (find-file full-file-name))

        (message "[harpoon] File %s not found." full-file-name)))))
#+end_src
